       IDENTIFICATION DIVISION.
       PROGRAM-ID.INDEX.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT ARQ-ENTRADA
           ASSIGN TO "FILMES.dat"
           ORGANIZATION IS INDEXED
           ACCESS IS RANDOM
           RECORD KEY IS CODIGO
           FILE STATUS IS WS-FS.
       DATA DIVISION.
       FILE SECTION.
       FD ARQ-ENTRADA.
           COPY REG-FILME.
       WORKING-STORAGE SECTION.
           77 WS-FS PIC 99.
           COPY WS-FILME.
           77 WS-EOF PIC A.
       SCREEN SECTION.
           COPY S-CAD-FILME.
       PROCEDURE DIVISION.
       OPEN OUTPUT ARQ-ENTRADA.
       IF WS-FS <> 0
           DISPLAY "ERRO NA ABERTURA WS-FS: " WS-FS
           CLOSE ARQ-ENTRADA
           STOP RUN.
       A03-INCLUI.
           DISPLAY CADFILME.
           ACCEPT CADFILME.
           MOVE WS-FILME TO REG-FILME.
           WRITE REG-FILME.
       CLOSE ARQ-ENTRADA.
       STOP RUN.
