       IDENTIFICATION DIVISION.
       PROGRAM-ID.INDEX.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT ARQ-ENTRADA
           ASSIGN TO "CLIENTES.dat"
           ORGANIZATION IS INDEXED
           ACCESS IS RANDOM 
           RECORD KEY IS CCPF
           FILE STATUS IS WS-FS.
       DATA DIVISION.
       FILE SECTION.
       FD ARQ-ENTRADA.
           COPY REG-DATA-CLIENTES.
       WORKING-STORAGE SECTION.
           77 WS-FS PIC 99.
           77 WS-EOF PIC A(1).
           COPY WS-CLIENTE.
       SCREEN SECTION.
           COPY S-CLIENTE.
       PROCEDURE DIVISION.
       OPEN INPUT ARQ-ENTRADA.
       IF WS-FS <> 0
           DISPLAY "ERRO NA ABERTURA WS-FS: " WS-FS
           CLOSE ARQ-ENTRADA
           STOP RUN.
       DISPLAY "DIGITE O CPF A SER LIDO: ".
       ACCEPT CCPF.
       READ ARQ-ENTRADA RECORD INTO WS-CLIENTES
           KEY IS CCPF
           INVALID KEY DISPLAY 'INVALID KEY'
           NOT INVALID KEY PERFORM A03-LER.
       CLOSE ARQ-ENTRADA.
       STOP RUN.
       A03-LER.
           DISPLAY CLIENT-DATA.
       
