       01 REG-FILME.
           05 CODIGO PIC 9(3).
           05 NOME PIC X(80).
           05 ANO PIC 9(4).
           05 SINOPSE PIC X(200).
           05 ISTATUS PIC 9(1) VALUE 1.
