       01 ALTERAC.
           02 BLANK SCREEN.
           02 LINE 01 COL 01 VALUE "**********************************".
           02 LINE 02 COL 05 VALUE "ALTERAR".
           02 LINE 03 COL 03 VALUE "DIGITE O CPF A SER ALTERADO".
           02 LINE 04 COL 03 PIC 9(11) TO CCPF.
