       01 CADFILME.
            02 BLANK SCREEN.
            02 LINE 01 COL 01 VALUE "******************************".
            02 LINE 02 COL 05 VALUE "CADASTRAR FILME".
            02 LINE 03 COL 02 VALUE "CODIGO: ".
            02 LINE 03 COL 13 PIC Z(3) TO WS-CODIGO.
            02 LINE 04 COL 02 VALUE "NOME: ".
            02 LINE 04 COL 13 PIC X(80) TO WS-FNOME.
            02 LINE 05 COL 02 VALUE "ANO: ".
            02 LINE 05 COL 13 PIC Z(4) TO WS-ANO.
            02 LINE 06 COL 02 VALUE "SINOPSE: ".
            02 LINE 06 COL 13 PIC X(200) TO WS-SINOPSE.
