       01 DEVOLVER.
               02 BLANK SCREEN.
               02 LINE 01 COL 01 VALUE "******************************".
               02 LINE 02 COL 10 VALUE "DEVOLUCAO".
               02 LINE 03 COL 03 VALUE "DIGITE O CODIGO DO FILME".
               02 LINE 04 COL 03 PIC 9(3) TO CODIGO.
               02 LINE 05 COL 03 VALUE "DIGITE O CPF DO CLIENTE".
               02 LINE 06 COL 03 PIC 9(11) TO CCPF.
