       01 EXCLUIF.
           02 BLANK SCREEN.
           02 LINE 01 COL 01 VALUE "******************************".
           02 LINE 02 COL 05 VALUE "EXCLUIR".
           02 LINE 03 COL 03 VALUE "DIGITE O CODIGO A SER EXCLUIDO".
           02 LINE 04 COL 03 PIC 9(3) TO CODIGO.
