       01 WS-CLIENTES.
            05 WS-CCPF PIC 9(11).
            05 WS-CNOME PIC X(50).
            05 WS-CCEP PIC 9(8).
            05 WS-CRUA PIC X(50).
            05 WS-CNUM PIC 9(5).
            05 WS-CBAI PIC X(50).
            05 WS-CCID PIC X(50).
            05 WS-CUF PIC X(2).
            05 WS-FILME-ALUGADO PIC 9(3) VALUE ZEROES.
