       01 WS-FILME.
           05 WS-CODIGO PIC 9(3).
           05 WS-FNOME PIC X(80).
           05 WS-ANO PIC 9(4).
           05 WS-SINOPSE PIC X(200).
           05 WS-ISTATUS PIC 9(1) VALUE 1.
